---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.Dispose
source: html/67cfc0fe-aa04-4801-86dd-131b115671c7.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.Dispose Method

Releases all resources used by the RebarShapeMultiplanarDefinition

## Syntax (C#)
```csharp
public void Dispose()
```